docs/posts/2017-03-16-obamas-economic-record.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 27, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Obama's Economic Record</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Obama&rsquo;s Economic Record</h1>
<p class="subtitle" role="doc-subtitle">Mar 16, 2017</p>
</header><p>
In a recent discussion, one participant claimed that the &ldquo;last eight years of Obamanomics has crippled our struggling state,&rdquo; which I suspect is supported more by a political narrative than an analysis of the data.
</p>

<p>
The new administration is at least fortunate that the problems handed to them are not at the same level as those handed to the previous administration. During the Obama administration, economic growth was admittedly slow, but considering that he took office on the precipice of what could have been the second great depression, these national numbers look pretty good:
</p>

<ul class="org-ul">
<li>Longest streak in US history of private sector job growth, the difference can be noted by comparing 2008 and 2016 numbers:
<ul class="org-ul">
<li>In November 2008, the economy lost 533,000 jobs.</li>
<li>In November 2016, the economy gained 178,000 jobs.</li>
</ul></li>
<li>Unemployment dropped from 10% to 4.6%.</li>
<li>800 billion dollar decrease in deficit.</li>
<li>Deficit as percentage of GDP dropped from 9.8% to 3.2% with no increase in middle class taxes.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></li>
</ul>

<p>
To be fair, the economic numbers for the Obama administration are not all rosy, however. A significant worry is the increase in the national debt. Obama&rsquo;s policies added 983 billion dollars to the national debt. The budget deficits under his administration increased the debt by 6.5 trillion.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<p>
If the economy of Oklahoma has been crippled, surely the state government, dominated by the right, has played a significant role. 
</p>

<div class="tagline" id="orgfc6b297">
<p>
Tagged: <a href="../tags/politics.html">Politics</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I originally saw these numbers <a href="http://www.voices4hillary.com/when-trump-voters-say-they-suffered-for-8-years-under-obama-heres-the--2280512289.html">here</a>. Since the article contained no citations of sources, I corroborated and made some adjustments to them using this piece by <a href="https://www.nytimes.com/2016/12/02/business/economy/jobs-report.html">Patricia Cohen</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Determining how much of the national debt a president is responsible for is a tricky matter. One could just look at the total increase in the national debt, but that unfairly saddles a president with a debt increase during the first year that results from the previous president&rsquo;s final-year budget. One could also add up the deficits of the president&rsquo;s budgets, which is fairer than the first method, but saddles the president with deficit spending that was either out of the president&rsquo;s  control or not a result of the administration&rsquo;s policies. The third method, which is the most meaningful but hardest to calculate, is to determine how much the president&rsquo;s policies contributed to the national debt. 
Kimberly Amadeo provides a clear explanation of these methods, along with the resulting numbers, <a href="https://www.thebalance.com/national-debt-under-obama-3306293">here</a>.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 27, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
